Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Src/fm33ld5xx_fl_fdcan.c
#define     IS_CANFD_TXQUEUE_IM(__VALUE__)              (((__VALUE__) == FL_CANFD_TXQIM_LAST_MESSAGE_TRANSMITTED)   ||\
                                                          ((__VALUE__) == FL_CANFD_TXQIM_EVERY_TRANSMISSION))                                                          
                                                          
#define     IS_CANFD_TXHISTORYLIST_IM(__VALUE__)        (((__VALUE__) == FL_CANFD_THLIM_REACH_3P4_DEPTH)   ||\
                                                          ((__VALUE__) == FL_CANFD_THLIM_EVERY_TRANSMISSION))

#define     IS_CANFD_GAFL_PAGE_NUM(__VALUE__)           (((__VALUE__) == FL_CANFD_GAFL_PAGE_NUMBER_FIRST)    ||\
                                                         ((__VALUE__) == FL_CANFD_GAFL_PAGE_NUMBER_SECOND))

#define     IS_CANFD_FILTER_filterRPNMD(__VALUE__)          (((__VALUE__) == FL_CANFD_RETURN_PNF_MODE_AF)     	 ||\
                                                          ((__VALUE__) == FL_CANFD_RETURN_PNF_MODE_PNFID_AF) ||\
                                                          ((__VALUE__) == FL_CANFD_RETURN_PNF_MODE_PNF_AF)   ||\
                                                          ((__VALUE__) == FL_CANFD_RETURN_PNF_MODE_PNF))  

#define     IS_CANFD_GAFL_RULE_NUM(__VALUE__)           (((__VALUE__) <= 32U))
                                                          
#define     IS_CANFD_GAFL_IDE(__VALUE__)                (((__VALUE__) == FL_CANFD_GAFL_IDE_STANDARD)   ||\
                                                          ((__VALUE__) == FL_CANFD_GAFL_IDE_EXTENDED))

#define     IS_CANFD_GAFL_RTR(__VALUE__)                (((__VALUE__) == FL_CANFD_GAFL_RTR_DATA_FRAME)   ||\
                                                          ((__VALUE__) == FL_CANFD_GAFL_RTR_REMOTE_FRAME))
                                                          
#define     IS_CANFD_GAFL_IDEM(__VALUE__)               (((__VALUE__) == FL_CANFD_GAFL_IDEM_NOT_CONSIDERED)   ||\
                                                          ((__VALUE__) == FL_CANFD_GAFL_IDEM_CONSIDERED))

#define     IS_CANFD_GAFL_RTRM(__VALUE__)               (((__VALUE__) == FL_CANFD_GAFL_RTRM_NOT_CONSIDERED)   ||\
                                                          ((__VALUE__) == FL_CANFD_GAFL_RTRM_CONSIDERED))

#define     IS_CANFD_GAFL_SINGLE_RXMB(__VALUE__)        (((__VALUE__) == FL_CANFD_GAFL_SINGLE_RXMB_INVALID)   ||\
                                                          ((__VALUE__) == FL_CANFD_GAFL_SINGLE_RXMB_VALID))
                                                          
#define     IS_CANFD_GAFL_RXMB_NUM(__VALUE__)           ((__VALUE__) <= FL_CANFD_RXMB31)                                    
            
#define     IS_CANFD_TX_PRIORITY(__VALUE__)             (((__VALUE__) == FL_CANFD_TX_PRIORITY_ID) ||\
                                                          ((__VALUE__) == FL_CANFD_TX_PRIORITY_BUFFER))
                                                          
#define     IS_CANFD_ESI_CFG(__VALUE__)                 (((__VALUE__) == FL_CANFD_ESI_CONFIGURATION_NODE_STATE) ||\
                                                          ((__VALUE__) == FL_CANFD_ESI_CONFIGURATION_SOFTWARE))
                                                          
#define     IS_CANFD_TDCO_CFG(__VALUE__)                (((__VALUE__) == FL_CANFD_TDCO_CONFIGURATION_MEASURED_WITH_OFFSET) ||\
                                                          ((__VALUE__) == FL_CANFD_TDCO_CONFIGURATION_OFFSET))
                                                          
#define     IS_CANFD_FUNSTATE_TYPE(__VALUE__)           (((__VALUE__) == FL_DISABLE) ||\
                                                          ((__VALUE__) == FL_ENABLE))
														  
// PFL 
#define     IS_CANFD_GPFL_RULE_NUM(__VALUE__)           (((__VALUE__) <= 2U))
                                                          
#define     IS_CANFD_GPFL_IDE(__VALUE__)                (((__VALUE__) == FL_CANFD_GPFL_IDE_STANDARD)   ||\
                                                          ((__VALUE__) == FL_CANFD_GPFL_IDE_EXTENDED))

#define     IS_CANFD_GPFL_RTR(__VALUE__)                (((__VALUE__) == FL_CANFD_GPFL_RTR_DATA_FRAME)   ||\
                                                          ((__VALUE__) == FL_CANFD_GPFL_RTR_REMOTE_FRAME))
                                                          
#define     IS_CANFD_GPFL_IDEM(__VALUE__)               (((__VALUE__) == FL_CANFD_GPFL_IDEM_NOT_CONSIDERED)   ||\
                                                          ((__VALUE__) == FL_CANFD_GPFL_IDEM_CONSIDERED))

#define     IS_CANFD_GPFL_RTRM(__VALUE__)               (((__VALUE__) == FL_CANFD_GPFL_RTRM_NOT_CONSIDERED)   ||\
                                                          ((__VALUE__) == FL_CANFD_GPFL_RTRM_CONSIDERED))

#define     IS_CANFD_GPFL_SINGLE_RXMB(__VALUE__)        (((__VALUE__) == FL_CANFD_GPFL_SINGLE_RXMB_INVALID)   ||\
                                                          ((__VALUE__) == FL_CANFD_GPFL_SINGLE_RXMB_VALID))	
														  
#define     IS_CANFD_GPFL_RXMB_NUM(__VALUE__)           ((__VALUE__) <= FL_CANFD_RXMB31) 


#define     IS_CANFD_GPFL_GPFLANDOR(__VALUE__)        	(((__VALUE__) == FL_CANFD_GPFLANDOR_AND)   ||\
                                                          ((__VALUE__) == FL_CANFD_GPFLANDOR_OR))	

#define     IS_CANFD_GPFL_GPFLRANG0(__VALUE__)        	(((__VALUE__) == FL_CANFD_GPFLRANG0_MATCH)   ||\
                                                          ((__VALUE__) == FL_CANFD_GPFLRANG0_RANGE))

#define     IS_CANFD_GPFL_GPFLOUT0(__VALUE__)        	(((__VALUE__) == FL_CANFD_GPFLOUT0_WITHIN)   ||\
                                                          ((__VALUE__) == FL_CANFD_GPFLOUT0_OUTSIDE))
														  
#define     IS_CANFD_GPFL_OFFSET0(__VALUE__)           	((__VALUE__) <= 16) 

#define     IS_CANFD_GPFL_GPFLRANG1(__VALUE__)        	(((__VALUE__) == FL_CANFD_GPFLRANG1_MATCH)   ||\
                                                          ((__VALUE__) == FL_CANFD_GPFLRANG1_RANGE))

#define     IS_CANFD_GPFL_GPFLOUT1(__VALUE__)        	(((__VALUE__) == FL_CANFD_GPFLOUT1_WITHIN)   ||\
                                                          ((__VALUE__) == FL_CANFD_GPFLOUT1_OUTSIDE))
														  
#define     IS_CANFD_GPFL_OFFSET1(__VALUE__)           	((__VALUE__) <= 16) 






/**
  * @}
  */

/* Private consts ------------------------------------------------------------*/
/** @addtogroup CANFD_FL_Private_Consts
  * @{
  */

