Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Src/fm33ld5xx_fl_fdcan.c
const uint8_t RXMB_INDEX_START[4] = {0, 8, 16, 24};


/*	
	CANFD_BUFFER[] (结构体数组)
	│
	└── [0] (CANFD0 的配置)
    ├── RX_FIFO          	→ CANFD0_RX_FIFO (CANFD_RX_FIFO_Type)
    │	└── CFDRF[0]     	→ 操作接收 FIFO 的第1个寄存器
	|	└── CFDRF[1]	  	→ 操作接收 FIFO 的第2个寄存器
    ├── COMMON_FIFO      	→ CANFD0_COMMON_FIFO
    ├── TX_MESSAGE       	→ CANFD0_TX_MESSAGE
	|	└── CFDTM[0]		→ 操作TX MESSAGE BUFF 的第1个寄存器
	|	└── CFDTM[1]		→ ......
	|	└── CFDTM[2]		→ ......
	|	└── CFDTM[3]		→ ......
    ├── TX_HISTORY_LIST  	→ CANFD0_TX_HISTORY_LIST
    └── RX_MESSAGE[4]    	→ {CANFD0_RX_MESSAGE0, ..., CANFD0_RX_MESSAGE3}
	|	└── CFDRM[0]		→ 操作RX MESSAGE BUFF 的第1个寄存器
	|	└── CFDRM[1]		→ ......
	|	......
	|	└── CFDRM[7]		→ ......
	
	
	typedef struct
	{
		CANFD_RX_FIFO_Type         * RX_FIFO;
		CANFD_COMMON_FIFO_Type     * COMMON_FIFO;
		CANFD_TX_MESSAGE_Type      * TX_MESSAGE;
		CANFD_TX_HISTORY_LIST_Type * TX_HISTORY_LIST;
		CANFD_RX_MESSAGE_Type      * RX_MESSAGE[4];
	}CANFD_BUFFER_TYPE;
*/
const CANFD_BUFFER_TYPE CANFD_BUFFER[] = 
{
	{	/* CANFD0 */
		CANFD0_RX_FIFO, 			
		CANFD0_COMMON_FIFO, 		
		CANFD0_TX_MESSAGE, 			
		CANFD0_TX_HISTORY_LIST, 	
		CANFD0_RX_MESSAGE0, 		
		CANFD0_RX_MESSAGE1, 		
		CANFD0_RX_MESSAGE2, 		
		CANFD0_RX_MESSAGE3
	}
    
    /* CANFD1 */
//    {CANFD1_RX_FIFO, CANFD1_COMMON_FIFO, CANFD1_TX_MESSAGE, CANFD1_TX_HISTORY_LIST, \
//    {CANFD1_RX_MESSAGE0, CANFD1_RX_MESSAGE1, CANFD1_RX_MESSAGE2, CANFD1_RX_MESSAGE3}}
};

/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/



/* Exported functions --------------------------------------------------------*/
/** @addtogroup CANFD_FL_EF_Init
  * @{
  */

/**
  * @brief  CANFD初始化
  * @param  CANFDx外设入口地址
  * @param  CANFD_InitStruct 指向一个@ref FL_CANFD_InitTypeDef  结构体的指针
  * @retval 错误状态可能值
  *         -FL_FAIL 配置过程发生错误
  *         -FL_PASS 配置成功
  */
FL_ErrorStatus FL_CANFD_Init(CANFD_COMMON_Type *CANFDx, FL_CANFD_InitTypeDef *CANFD_InitStruct)
{
    uint32_t i, index;
    FL_ErrorStatus status = FL_FAIL;
    
    if(CANFD_InitStruct != NULL)
    {
        /*参数检查*/
        assert_param(IS_CANFD_INSTANCE(CANFDx));
        
        /*全局模式和通道模式检查*/
        assert_param(IS_CANFD_GLOBAL_MODE(CANFD_InitStruct->globalMode));
        assert_param(IS_CANFD_CHANNEL_MODE(CANFD_InitStruct->channelMode));
        
        if ((CANFD_InitStruct->globalMode == FL_CANFD_GLOBAL_MODE_RESET) &&\
            (CANFD_InitStruct->channelMode != FL_CANFD_CHANNEL_MODE_RESET))
        {
            return FL_FAIL;
        }
        
        /* 位速率参数检查 */
        assert_param(IS_CANFD_NB_SJW(CANFD_InitStruct->NB_SJW));
        assert_param(IS_CANFD_NB_TS1(CANFD_InitStruct->NB_TS1));
        assert_param(IS_CANFD_NB_TS2(CANFD_InitStruct->NB_TS2));
        assert_param(IS_CANFD_DB_SJW(CANFD_InitStruct->DB_SJW));
        assert_param(IS_CANFD_DB_TS1(CANFD_InitStruct->DB_TS1));
        assert_param(IS_CANFD_DB_TS2(CANFD_InitStruct->DB_TS2));
        
        /* 时钟源检查 */

        assert_param(IS_CANFD0_CLOCK_SOURCE(CANFD_InitStruct->clockSource));
        assert_param(IS_CANFD0_CLOCK_SOURCE_RAM(CANFD_InitStruct->clockSourceRAM));


        /* RxMB参数检查 */
        assert_param(IS_CANFD_RXMB_PLS(CANFD_InitStruct->rxmbCfg.payloadDataSize));
        assert_param(IS_CANFD_RXMB_NUM(CANFD_InitStruct->rxmbCfg.rxmbNum));
        
        /* RxFIFO参数检查 */
        for (i = 0; i < 2; i++)
        {
            if (CANFD_InitStruct->rxfifoCfg[i].Enable == FL_ENABLE)
            {
                assert_param(IS_CANFD_RXFIFO_IGCV(CANFD_InitStruct->rxfifoCfg[i].intGenCounterValue));
                assert_param(IS_CANFD_RXFIFO_IM(CANFD_InitStruct->rxfifoCfg[i].intMode));
                assert_param(IS_CANFD_RXFIFO_DC(CANFD_InitStruct->rxfifoCfg[i].fifoDepth));
                assert_param(IS_CANFD_RXFIFO_PLS(CANFD_InitStruct->rxfifoCfg[i].payloadDataSize));
            }
        }
        
        /* CommonFIFO参数检查 */
        if (CANFD_InitStruct->commonfifoCfg.Enable == FL_ENABLE)
        {
            assert_param(IS_CANFD_COMMONFIFO_DC(CANFD_InitStruct->commonfifoCfg.fifoDepth));
            assert_param(IS_CANFD_COMMONFIFO_TML(CANFD_InitStruct->commonfifoCfg.txmbLink));
            assert_param(IS_CANFD_COMMONFIFO_IGCV(CANFD_InitStruct->commonfifoCfg.intGenCounterValue));
            assert_param(IS_CANFD_COMMONFIFO_IM(CANFD_InitStruct->commonfifoCfg.intMode));
            assert_param(IS_CANFD_COMMONFIFO_ITR(CANFD_InitStruct->commonfifoCfg.intervalTimerResolution));
            assert_param(IS_CANFD_COMMONFIFO_ITSS(CANFD_InitStruct->commonfifoCfg.intervalTimerSource));
            assert_param(IS_CANFD_COMMONFIFO_MODE(CANFD_InitStruct->commonfifoCfg.fifoMode));
            assert_param(IS_CANFD_COMMONFIFO_PLS(CANFD_InitStruct->commonfifoCfg.payloadDataSize));
        }
        
        /* TxQueue参数检查 */
        if (CANFD_InitStruct->txqueueCfg.Enable == FL_ENABLE)
        {
            assert_param(IS_CANFD_TXQUEUE_DC(CANFD_InitStruct->txqueueCfg.queueDepth));
            assert_param(IS_CANFD_TXQUEUE_IM(CANFD_InitStruct->txqueueCfg.intMode));
        }
        
        /* CommonFIFO和TxQueue参数冲突检查 */
        if (CANFD_InitStruct->commonfifoCfg.fifoMode == FL_CANFD_CFM_TX_FIFO)
        {
            if ((CANFD_InitStruct->txqueueCfg.queueDepth == FL_CANFD_TXQDC_DEPTH_4) ||\
                ((CANFD_InitStruct->txqueueCfg.queueDepth == FL_CANFD_TXQDC_DEPTH_3) && (CANFD_InitStruct->commonfifoCfg.txmbLink != FL_CANFD_CFTML_TXMB3)))
            {
                return FL_FAIL;
            }
        }

        /* TxHistoryList参数检查 */
        if (CANFD_InitStruct->txHistoryCfg.Enable == FL_ENABLE)
        {
            assert_param(IS_CANFD_TXHISTORYLIST_IM(CANFD_InitStruct->txHistoryCfg.intMode));
        }
        
		
		/* 滤波器模式参数检查 */
		assert_param(IS_CANFD_FILTER_filterRPNMD(CANFD_InitStruct->filterRPNMD));
        /* AcceptanceFilterList参数检查，包含32个AFL */
        assert_param(IS_CANFD_GAFL_RULE_NUM(CANFD_InitStruct->acceptanceFilterRuleNum));
        for (i = 0; i < 32; i++)
        {
            if (CANFD_InitStruct->acceptanceFilterCfg[i].filterEnable == FL_ENABLE)
            {
                assert_param(IS_CANFD_GAFL_IDE(CANFD_InitStruct->acceptanceFilterCfg[i].filterIDE));
                assert_param(IS_CANFD_GAFL_RTR(CANFD_InitStruct->acceptanceFilterCfg[i].filterRTR));
                assert_param(IS_CANFD_GAFL_IDEM(CANFD_InitStruct->acceptanceFilterCfg[i].filterIDEMask));
                assert_param(IS_CANFD_GAFL_RTRM(CANFD_InitStruct->acceptanceFilterCfg[i].filterRTRMask));
                assert_param(IS_CANFD_GAFL_SINGLE_RXMB(CANFD_InitStruct->acceptanceFilterCfg[i].rxmbValid));
                assert_param(IS_CANFD_GAFL_RXMB_NUM(CANFD_InitStruct->acceptanceFilterCfg[i].rxmbNum));
            }
        }
		
		
		/* Pretended Network Filter List 参数检查，包含2个filter */
        assert_param(IS_CANFD_GPFL_RULE_NUM(CANFD_InitStruct->pflFilterRuleNum));
        for (i = 0; i < 2; i++)
        {
            if (CANFD_InitStruct->pflFilterCfg[i].PFL_Enable == FL_ENABLE)
            {
                assert_param(IS_CANFD_GPFL_IDE(CANFD_InitStruct->pflFilterCfg[i].PFL_IDE));
                assert_param(IS_CANFD_GPFL_RTR(CANFD_InitStruct->pflFilterCfg[i].PFL_RTR));
                assert_param(IS_CANFD_GPFL_IDEM(CANFD_InitStruct->pflFilterCfg[i].PFL_IDEMask));
                assert_param(IS_CANFD_GPFL_RTRM(CANFD_InitStruct->pflFilterCfg[i].PFL_RTRMask));
                assert_param(IS_CANFD_GPFL_SINGLE_RXMB(CANFD_InitStruct->pflFilterCfg[i].PFL_rxmbValid));
                assert_param(IS_CANFD_GPFL_RXMB_NUM(CANFD_InitStruct->pflFilterCfg[i].PFL_rxmbNum));
				assert_param(IS_CANFD_GPFL_GPFLANDOR(CANFD_InitStruct->pflFilterCfg[i].PFL_AND_OR));
				assert_param(IS_CANFD_GPFL_GPFLRANG0(CANFD_InitStruct->pflFilterCfg[i].PFL_GPFLRANG0));
				assert_param(IS_CANFD_GPFL_GPFLOUT0(CANFD_InitStruct->pflFilterCfg[i].PFL_GPFLOUT0));
				assert_param(IS_CANFD_GPFL_OFFSET0(CANFD_InitStruct->pflFilterCfg[i].PFL_OFFSET0));
				assert_param(IS_CANFD_GPFL_GPFLRANG1(CANFD_InitStruct->pflFilterCfg[i].PFL_GPFLRANG1));
				assert_param(IS_CANFD_GPFL_GPFLOUT1(CANFD_InitStruct->pflFilterCfg[i].PFL_GPFLOUT1));
				assert_param(IS_CANFD_GPFL_OFFSET1(CANFD_InitStruct->pflFilterCfg[i].PFL_OFFSET1));
            }
        }
        
        /* 特殊参数检查 */
        assert_param(IS_CANFD_TX_PRIORITY(CANFD_InitStruct->txPriority));
        assert_param(IS_CANFD_ESI_CFG(CANFD_InitStruct->esiCfg));
        assert_param(IS_CANFD_TDCO_CFG(CANFD_InitStruct->tdcoCfg));
        assert_param(IS_CANFD_FUNSTATE_TYPE(CANFD_InitStruct->tdcoEnable));
        assert_param(IS_CANFD_FUNSTATE_TYPE(CANFD_InitStruct->respedEnable));
        assert_param(IS_CANFD_FUNSTATE_TYPE(CANFD_InitStruct->dlcCheckEnable));
        assert_param(IS_CANFD_FUNSTATE_TYPE(CANFD_InitStruct->dlcReplacementEnable));
        assert_param(IS_CANFD_FUNSTATE_TYPE(CANFD_InitStruct->messageIsRejected));
        

		
		/* ↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓ 参数开始配置 ↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓ */
        /* 时钟总线配置，CMU中配置 */
		FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_CANFD0);
		FL_CMU_SetCANFD0ClockSource(CANFD_InitStruct->clockSource);
		FL_CMU_SetCANFD0ClockSourceRam(CANFD_InitStruct->clockSourceRAM);
		FL_CMU_EnableCANFDOperationClock(FL_CMU_OPCLK_CANFD_COMM);
		FL_CMU_EnableCANFDOperationClock(FL_CMU_OPCLK_CANFD_RAM);


        
        /* 等待RAM初始化完成 */
		/* 25.16.13 CFDGSTS[3]:FDCAN RAM初始化完成标志，所有操作均需要等待RAM init finish后进行操作 */
        while(FL_CANFD_Global_IsActiveFlag_GlobalRAMInitialisation(CANFDx))
        {
            /* 直至看门狗溢出复位 
			 * 1’b0: RAM initialisation is finished
			 * 1’b1: RAM initialisation ongoing
			 */
			/* 增加超时退出逻辑 */
			// User Code......
        }
        
        /* 主动复位 */
        FL_CANFD_Global_WriteKeyOfReset(CANFDx, 0xC4);						/* 25.16.52 CFDGRSTC[15:8]:软件复位key(0xC4) */
        FL_CANFD_Global_SetSoftwareReset(CANFDx, FL_CANFD_SRST_RESET);		/* 25.16.52 CFDGRSTC[0]:软件置位 SRST 将使 RS-CANFD 模块全局复位，软件清零撤销复位 */
        FL_CANFD_Global_SetSoftwareReset(CANFDx, FL_CANFD_SRST_NO_RESET);	/* 软件复位不会导致RAM重新初始化 */
        
        /* 退出global sleep和channel sleep */
        FL_CANFD_Global_Disable_Sleep(CANFDx);
        FL_CANFD_CH0_Disable_Sleep(CANFDx);
        
