Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Src/fm33ld5xx_fl_fdcan.c
        /* 进入global reset和channel reset */
		/* 部分寄存器，用户只能在 CH_RESET 和 CH_HALT 模式下改写，所以必须先进入RESET状态 */
        FL_CANFD_Global_SetGlobalMode(CANFDx, FL_CANFD_GLOBAL_MODE_RESET);
        FL_CANFD_CH0_SetChannelMode(CANFDx, FL_CANFD_CHANNEL_MODE_RESET);
        
        /* 配置位速率 */
        FL_CANFD_CH0_WriteNominalBitrateTimeSegment1Length(CANFDx, CANFD_InitStruct->NB_TS1);
        FL_CANFD_CH0_WriteNominalBitrateTimeSegment2Length(CANFDx, CANFD_InitStruct->NB_TS2);
        FL_CANFD_CH0_WriteNominalBitrateSyncJumpWidth(CANFDx, CANFD_InitStruct->NB_SJW);
        FL_CANFD_CH0_WriteNominalBitratePrescaler(CANFDx, CANFD_InitStruct->NB_BRP);
        FL_CANFD_CH0_WriteDataBitrateTimeSegment1Length(CANFDx, CANFD_InitStruct->DB_TS1);
        FL_CANFD_CH0_WriteDataBitrateTimeSegment2Length(CANFDx, CANFD_InitStruct->DB_TS2);
        FL_CANFD_CH0_WriteDataBitrateSyncJumpWidth(CANFDx, CANFD_InitStruct->DB_SJW);
        FL_CANFD_CH0_WriteDataBitratePrescaler(CANFDx, CANFD_InitStruct->DB_BRP);        
        
        /* 配置RxMB */
        FL_CANFD_Global_SetRxMBPayloadDataSize(CANFDx, CANFD_InitStruct->rxmbCfg.payloadDataSize);
        FL_CANFD_Global_WriteNumberOfRxMB(CANFDx, CANFD_InitStruct->rxmbCfg.rxmbNum);
        
        /* 配置RxFIFO */
        for (i = 0; i < 2; i++)
        {
            if (CANFD_InitStruct->rxfifoCfg[i].Enable == FL_ENABLE)
            {
                FL_CANFD_Global_SetRxFIFOInterruptGenerationCounterValue(CANFDx, i, CANFD_InitStruct->rxfifoCfg[i].intGenCounterValue);
                FL_CANFD_Global_SetRxFIFOInterruptMode(CANFDx, i, CANFD_InitStruct->rxfifoCfg[i].intMode);
                FL_CANFD_Global_SetRxFIFODepth(CANFDx, i, CANFD_InitStruct->rxfifoCfg[i].fifoDepth);
                FL_CANFD_Global_SetRxFIFOPayloadDataSize(CANFDx, i, CANFD_InitStruct->rxfifoCfg[i].payloadDataSize);
                if (CANFD_InitStruct->rxfifoCfg[i].intEnable == FL_ENABLE)
                {
                    FL_CANFD_Global_EnableIT_RxFIFO(CANFDx, i);                    
                }
                else
                {
                    FL_CANFD_Global_DisableIT_RxFIFO(CANFDx, i);
                }
                /* RxFIFO使能必须在OPERATION模式下配置 */
            }
        }
        
        /* 配置CommonFIFO */
        if (CANFD_InitStruct->commonfifoCfg.Enable == FL_ENABLE)
        {
            FL_CANFD_Global_WriteCommonFIFOIntervalTransmissionTime(CANFDx, CANFD_InitStruct->commonfifoCfg.txInterval);
            FL_CANFD_Global_SetCommonFIFODepth(CANFDx, CANFD_InitStruct->commonfifoCfg.fifoDepth);
            FL_CANFD_Global_SetCommonFIFOTxMBLink(CANFDx, CANFD_InitStruct->commonfifoCfg.txmbLink);
            FL_CANFD_Global_SetCommonFIFOInterruptGenerationCounterValue(CANFDx, CANFD_InitStruct->commonfifoCfg.intGenCounterValue);
            FL_CANFD_Global_SetCommonFIFOInterruptMode(CANFDx, CANFD_InitStruct->commonfifoCfg.intMode);
            FL_CANFD_Global_SetCommonFIFOIntervalTimerResolution(CANFDx, CANFD_InitStruct->commonfifoCfg.intervalTimerResolution);
            FL_CANFD_Global_SetCommonFIFOIntervalTimerSource(CANFDx, CANFD_InitStruct->commonfifoCfg.intervalTimerSource);
            FL_CANFD_Global_SetCommonFIFOMode(CANFDx, CANFD_InitStruct->commonfifoCfg.fifoMode);
            FL_CANFD_Global_SetCommonFIFOPayloadDataSize(CANFDx, CANFD_InitStruct->commonfifoCfg.payloadDataSize);
            if (CANFD_InitStruct->commonfifoCfg.intEnable == FL_ENABLE)
            {
                if (CANFD_InitStruct->commonfifoCfg.fifoMode == FL_CANFD_CFM_TX_FIFO)
                {
                    FL_CANFD_Global_DisableIT_CommonFIFORx(CANFDx);
                    FL_CANFD_Global_EnableIT_CommonFIFOTx(CANFDx);
                }
                else
                {
                    FL_CANFD_Global_DisableIT_CommonFIFOTx(CANFDx);
                    FL_CANFD_Global_EnableIT_CommonFIFORx(CANFDx);
                }
            }            
            /* CommonFIFO使能必须在OPERATION模式下配置 */
        }

        /* 配置TxQueue */
        if (CANFD_InitStruct->txqueueCfg.Enable == FL_ENABLE)
        {
            FL_CANFD_Global_SetTxQueueDepth(CANFDx, CANFD_InitStruct->txqueueCfg.queueDepth);
            FL_CANFD_Global_SetTxQueueInterruptMode(CANFDx, CANFD_InitStruct->txqueueCfg.intMode);
            if (CANFD_InitStruct->txqueueCfg.intEnable == FL_ENABLE)
            {
                FL_CANFD_Global_EnableIT_TxQueueTx(CANFDx);
            }
            else
            {
                FL_CANFD_Global_DisableIT_TxQueueTx(CANFDx);
            }
            /* TxQueue使能必须在OPERATION模式下配置 */
        }
        
        /* 配置TxHistoryList */
        if (CANFD_InitStruct->txHistoryCfg.Enable == FL_ENABLE)
        {
            if (CANFD_InitStruct->txHistoryCfg.dedicatedTxEnable == FL_ENABLE)
            {
                FL_CANFD_Global_Enable_TxHistoryListDedicatedTx(CANFDx);
            }
            else
            {
                FL_CANFD_Global_Disable_TxHistoryListDedicatedTx(CANFDx);
            }
            
            FL_CANFD_Global_SetTxHistoryListInterruptMode(CANFDx, CANFD_InitStruct->txHistoryCfg.intMode);
            if (CANFD_InitStruct->txHistoryCfg.intEnable == FL_ENABLE)
            {
                FL_CANFD_Global_EnableIT_TxHistoryList(CANFDx);
            }
            else
            {
                FL_CANFD_Global_DisableIT_TxHistoryList(CANFDx);
            }
            /* TxQueue使能必须在OPERATION模式下配置 */
        }
       
		
        /* 接收滤波器配置,AFL和PFL组合用法 */
			
		/* 25.16.17 CFDGAFLECTR[8]:接收滤波器列表配置进入控制寄存器，使能后才可以配置滤波器参数*/
        FL_CANFD_Global_Enable_GAFLDataAccess(CANFDx);			
		/* 25.16.17 CFDGAFLECTR[0]：滤波器列表页码 0 or 1*/
        FL_CANFD_Global_SetGAFLPageNumber(CANFDx, FL_CANFD_GAFL_PAGE_NUMBER_FIRST);
		/* 25.16.18 CFDGAFLCFG[21:16]:接收规则数目 1~32 */
        FL_CANFD_Global_WriteGAFLRuleNumber(CANFDx, CANFD_InitStruct->acceptanceFilterRuleNum);
		
        for (i = 0; i < 32; i++)	/* 共32个AFL元素 */
        {
            if (i == 16)
            {
				/* 当配置规则数超过半数时，设置页面到 second page */
                FL_CANFD_Global_SetGAFLPageNumber(CANFDx, FL_CANFD_GAFL_PAGE_NUMBER_SECOND);
            }
            
            index = i & 0xF;	/* 只取i的低半字节，或者2个page的配置索引元素号 */
            if (CANFD_InitStruct->acceptanceFilterCfg[i].filterEnable == FL_ENABLE)		
            {
                FL_CANFD_Global_SetGAFLIDE(CANFDx, index, CANFD_InitStruct->acceptanceFilterCfg[i].filterIDE);
                FL_CANFD_Global_SetGAFLRTR(CANFDx, index, CANFD_InitStruct->acceptanceFilterCfg[i].filterRTR);
                FL_CANFD_Global_WriteGAFLID(CANFDx, index, CANFD_InitStruct->acceptanceFilterCfg[i].filterID);
                FL_CANFD_Global_SetGAFLIDEMask(CANFDx, index, CANFD_InitStruct->acceptanceFilterCfg[i].filterIDEMask);
                FL_CANFD_Global_SetGAFLRTRMask(CANFDx, index, CANFD_InitStruct->acceptanceFilterCfg[i].filterRTRMask);
                FL_CANFD_Global_WriteGAFLIDMask(CANFDx, index, CANFD_InitStruct->acceptanceFilterCfg[i].filterIDMask);
                FL_CANFD_Global_SetGAFLRxMBValid(CANFDx, index, CANFD_InitStruct->acceptanceFilterCfg[i].rxmbValid);
                FL_CANFD_Global_WriteGAFLRxMBDirectionPointer(CANFDx, index, CANFD_InitStruct->acceptanceFilterCfg[i].rxmbNum);
                FL_CANFD_Global_WriteGAFLDLC(CANFDx, index, CANFD_InitStruct->acceptanceFilterCfg[i].dlc);
                if (CANFD_InitStruct->acceptanceFilterCfg[i].commonfifoRecvEnable == FL_ENABLE)
                {
                    FL_CANFD_Global_Enable_GAFLCommonFIFOReception(CANFDx, index);
                }
                else
                {
                    FL_CANFD_Global_Disable_GAFLCommonFIFOReception(CANFDx, index);
                }
                if (CANFD_InitStruct->acceptanceFilterCfg[i].rxfifo0RecvEnable == FL_ENABLE)
                {
                    FL_CANFD_Global_Enable_GAFLRxFIFOReception(CANFDx, index, FL_CANFD_RXFIFO0);
                }
                else
                {
                    FL_CANFD_Global_Disable_GAFLRxFIFOReception(CANFDx, index, FL_CANFD_RXFIFO0);
                }
                if (CANFD_InitStruct->acceptanceFilterCfg[i].rxfifo1RecvEnable == FL_ENABLE)
                {
                    FL_CANFD_Global_Enable_GAFLRxFIFOReception(CANFDx, index, FL_CANFD_RXFIFO1);
                }
                else
                {
                    FL_CANFD_Global_Disable_GAFLRxFIFOReception(CANFDx, index, FL_CANFD_RXFIFO1);
                }                
            }
        }
		/* 25.16.17 CFDGAFLECTR[8]:接收滤波器列表配置进入控制寄存器，关闭后保护滤波器参数不被修改*/
        FL_CANFD_Global_Disable_GAFLDataAccess(CANFDx);
		
		
