Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Src/fm33ld5xx_fl_fdcan.c
		/* Pretended Network Filter List 配置 */ 
		/* 25.16.58 CFDGPFLECTR[8]:接收滤波器列表配置进入控制寄存器，使能后才可以配置滤波器参数*/
        FL_CANFD_Global_Enable_GPFLDataAccess(CANFDx);			
		/* 25.16.59 CFDGPFLCFG[25:24]:接收规则数目 1~2 */
        FL_CANFD_Global_WriteGPFLRuleNumber(CANFDx, CANFD_InitStruct->pflFilterRuleNum);
		/*   i改为已经定义的rule num*/
        for (i = 0; i < 2; i++)	/* 共2个PFL元素,	0:filter0,	1:filter1 */
        {
            if (CANFD_InitStruct->pflFilterCfg[i].PFL_Enable == FL_ENABLE)		
            { 
                FL_CANFD_Global_SetGPFLIDE(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_IDE);
                FL_CANFD_Global_SetGPFLRTR(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_RTR);
                FL_CANFD_Global_WriteGPFLID(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_ID);
                FL_CANFD_Global_SetGPFLIDEMask(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_IDEMask);
                FL_CANFD_Global_SetGPFLRTRMask(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_RTRMask);
                FL_CANFD_Global_WriteGPFLIDMask(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_IDMask);
                FL_CANFD_Global_SetGPFLRxMBValid(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_rxmbValid);
                FL_CANFD_Global_WriteGPFLRxMBDirectionPointer(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_rxmbNum);
                FL_CANFD_Global_WriteGPFLDLC(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_dlc);
                if (CANFD_InitStruct->pflFilterCfg[i].PFL_commonfifoRecvEnable == FL_ENABLE)
                {
                    FL_CANFD_Global_Enable_GPFLCommonFIFOReception(CANFDx, i);
                }
                else
                {
                    FL_CANFD_Global_Disable_GPFLCommonFIFOReception(CANFDx, i);
                }
                if (CANFD_InitStruct->pflFilterCfg[i].PFL_rxfifo0RecvEnable == FL_ENABLE)
                {
                    FL_CANFD_Global_Enable_GPFLRxFIFOReception(CANFDx, i, FL_CANFD_RXFIFO0);
                }
                else
                {
                    FL_CANFD_Global_Disable_GPFLRxFIFOReception(CANFDx, i, FL_CANFD_RXFIFO0);
                }
                if (CANFD_InitStruct->pflFilterCfg[i].PFL_rxfifo1RecvEnable == FL_ENABLE)
                {
                    FL_CANFD_Global_Enable_GPFLRxFIFOReception(CANFDx, i, FL_CANFD_RXFIFO1);
                }
                else
                {
                    FL_CANFD_Global_Disable_GPFLRxFIFOReception(CANFDx, i, FL_CANFD_RXFIFO1);
                } 

				/* PFL Payload filter config */
				FL_CANFD_Global_SetGPFLConditionsOfFilters(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_AND_OR);
				FL_CANFD_Global_SetGPFLComparisonConditionsOfFilter0(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_GPFLRANG0);
				FL_CANFD_Global_SetGPFLLimitConditionsOfFilter0(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_GPFLOUT0);
				FL_CANFD_Global_WriteGPFLOffsetOfFilter0(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_OFFSET0);
				FL_CANFD_Global_SetGPFLComparisonConditionsOfFilter1(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_GPFLRANG1);
				FL_CANFD_Global_SetGPFLLimitConditionsOfFilter1(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_GPFLOUT1);
				FL_CANFD_Global_WriteGPFLOffsetOfFilter1(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_OFFSET1);
				FL_CANFD_Global_WriteGPFLFilterData0(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_Payload_Data0);
				FL_CANFD_Global_WriteGPFLFilterData0Mask(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_Payload_Data0Mask);
				FL_CANFD_Global_WriteGPFLFilterData1(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_Payload_Data1);
				FL_CANFD_Global_WriteGPFLFilterData1Mask(CANFDx, i, CANFD_InitStruct->pflFilterCfg[i].PFL_Payload_Data1Mask);
				
            }
        }
		/* 25.16.58 CFDGPFLECTR[8]:接收滤波器列表配置进入控制寄存器，关闭后保护滤波器参数不被修改*/
        FL_CANFD_Global_Disable_GPFLDataAccess(CANFDx);
		
		/* 接收滤波器配置一，AFL和PFL组合用法
		 * CANFD0->CFDC0FDCFG.RPNMD,该寄存器只能在Reset和Halt模式下改写
		 * CANFD0->CFDC0FDCTR.PNMDC,需要退出Reset模式后改写 */
		FL_CANFD_CH0_FD_SetReturnPNFMode(CANFDx, CANFD_InitStruct->filterRPNMD);

	
        /* 特殊参数配置 */
        FL_CANFD_Global_SetTxPriority(CANFDx, CANFD_InitStruct->txPriority);
        FL_CANFD_CH0_FD_SetErrorStateIndicationConfiguration(CANFDx, CANFD_InitStruct->esiCfg);
        FL_CANFD_CH0_FD_Write_TransceiverDelayCompensationOffset(CANFDx, CANFD_InitStruct->tdco);
        FL_CANFD_CH0_FD_SetTransceiverDelayCompensationOffsetConfiguration(CANFDx, CANFD_InitStruct->tdcoCfg);        
        if (CANFD_InitStruct->tdcoEnable == FL_ENABLE)
        {
            FL_CANFD_CH0_FD_Enable_TransceiverDelayCompensation(CANFDx);
        }
        else
        {
            FL_CANFD_CH0_FD_Disable_TransceiverDelayCompensation(CANFDx);
        }
        
        if (CANFD_InitStruct->respedEnable == FL_ENABLE)
        {
            FL_CANFD_Global_Disable_RESProtocolExceptionDisabled(CANFDx);
        }
        else
        {
            FL_CANFD_Global_Enable_RESProtocolExceptionDisabled(CANFDx);
        }
        
        if (CANFD_InitStruct->dlcCheckEnable == FL_ENABLE)
        {
            FL_CANFD_Global_Enable_DLCCheck(CANFDx);
            if (CANFD_InitStruct->dlcReplacementEnable == FL_ENABLE)
            {
                FL_CANFD_Global_Enable_DLCReplacement(CANFDx);
            }
            else
            {
                FL_CANFD_Global_Disable_DLCReplacement(CANFDx);
            }
        }
        else
        {
            FL_CANFD_Global_Disable_DLCCheck(CANFDx);
            FL_CANFD_Global_Disable_DLCReplacement(CANFDx);
        }
        
        if (CANFD_InitStruct->messageIsRejected == FL_ENABLE)
        {
            FL_CANFD_Global_SetCANFDMessagePayloadOverflowConfiguration(CANFDx, FL_CANFD_CMPOC_CONFIGURATION_REJECTED);
        }
        else
        {
            FL_CANFD_Global_SetCANFDMessagePayloadOverflowConfiguration(CANFDx, FL_CANFD_CMPOC_CONFIGURATION_CUTOFF);
        }
        
        /*配置全局和通道的工作模式为Operation Mode*/
        if (CANFD_InitStruct->globalMode == FL_CANFD_GLOBAL_MODE_OPERATION)
        {
            FL_CANFD_Global_SetGlobalMode(CANFDx, FL_CANFD_GLOBAL_MODE_OPERATION);            
        }
        else if (CANFD_InitStruct->globalMode == FL_CANFD_GLOBAL_MODE_RESET)
        {
            FL_CANFD_Global_SetGlobalMode(CANFDx, FL_CANFD_GLOBAL_MODE_RESET);            
        }
        else if (CANFD_InitStruct->globalMode == FL_CANFD_GLOBAL_MODE_HALT)
        {
            FL_CANFD_Global_SetGlobalMode(CANFDx, FL_CANFD_GLOBAL_MODE_HALT);            
        }
        
