Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Src/fm33ld5xx_fl_fdcan.c
        if (CANFD_InitStruct->channelMode == FL_CANFD_CHANNEL_MODE_OPERATION)
        {
            FL_CANFD_CH0_SetChannelMode(CANFDx, FL_CANFD_CHANNEL_MODE_OPERATION);
            while (FL_CANFD_CH0_IsActiveFlag_SleepStatus(CANFDx) || 
                   FL_CANFD_CH0_IsActiveFlag_HaltStatus(CANFDx)  || 
                   FL_CANFD_CH0_IsActiveFlag_ResetStatus(CANFDx))
            {
                /* 直至看门狗溢出复位 */
            }
        }
        else if (CANFD_InitStruct->channelMode == FL_CANFD_CHANNEL_MODE_RESET)
        {
            FL_CANFD_CH0_SetChannelMode(CANFDx, FL_CANFD_CHANNEL_MODE_RESET);
            while (!FL_CANFD_CH0_IsActiveFlag_ResetStatus(CANFDx))
            {
                /* 直至看门狗溢出复位 */
            }
        }
        else if (CANFD_InitStruct->channelMode == FL_CANFD_CHANNEL_MODE_HALT)
        {
            FL_CANFD_CH0_SetChannelMode(CANFDx, FL_CANFD_CHANNEL_MODE_HALT);
            while (!FL_CANFD_CH0_IsActiveFlag_HaltStatus(CANFDx))
            {
                /* 直至看门狗溢出复位 */
            }
        }        
        
        /*使能Buffer*/
        if (!FL_CANFD_CH0_IsActiveFlag_SleepStatus(CANFDx) &&
            !FL_CANFD_CH0_IsActiveFlag_ResetStatus(CANFDx))
        {
            /* 配置RxFIFO */
            for (i = 0; i < 2; i++)
            {
                if (CANFD_InitStruct->rxfifoCfg[i].Enable == FL_ENABLE)
                {
                    FL_CANFD_Global_Enable_RxFIFO(CANFDx, i);
                }
            }

            /* 配置CommonFIFO */
            if (CANFD_InitStruct->commonfifoCfg.Enable == FL_ENABLE)
            {
                FL_CANFD_Global_Enable_CommonFIFO(CANFDx);
            }

            /* 配置TxQueue */
            if (CANFD_InitStruct->txqueueCfg.Enable == FL_ENABLE)
            {
                FL_CANFD_Global_Enable_TxQueue(CANFDx);
            }
            
            /* 配置TxHistoryList */
            if (CANFD_InitStruct->txHistoryCfg.Enable == FL_ENABLE)
            {
                FL_CANFD_Global_Enable_TxHistoryList(CANFDx);
            }            
        }
        
		
		/* 接收滤波器配置二，AFL和PFL组合用法
		 * CANFD0->CFDC0FDCTR.PNMDC,需要退出Reset模式后改写
		 * 在写入时，需要将KEY和PNMDC参数一次性写入 */
//		CANFD0->CFDC0FDCTR = 0xC4030000;		/* [31:24]:KEY_C4h, [17:16]:PNMDC */
		FL_CANFD_CH0_FD_SetPNFMode(CANFDx,CANFD_InitStruct->filterPNMDC);

		
		
        status = FL_PASS;
    }
    
    return status;
}


/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup CANFD_FL_Private_Functions CAN Private Functions
  * @{
  */

/**
  * @}
  */

#endif /* FL_FDCAN_DRIVER_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/

